names=["北京","上海","深圳","济南","太原","台北","重庆","天津","西宁","拉萨","昆明","成都","武汉","长沙","贵阳","南宁",
       "海口","南昌","广州","福州","杭州","南京","合肥","郑州","西安","银川","兰州","乌鲁木齐","呼和浩特","沈阳","哈尔滨"
       , "长春","石家庄"]
print(names)
li=names.remove("广州")
print(names)
li=names.insert(1,"广州")
print(names)

GDP=[36710.36,35427.10,29863.23,29667.39,27665.36,27650.45,27620.38,25369.20]
print(GDP)

a=[36710.36+35427.10+29863.23+29667.39+27665.36+27650.45+27620.38+25369.20]
print(a)
b=((36710.36+35427.10+29863.23+29667.39+27665.36+27650.45+27620.38+25369.20)/8)
print(b)
